<?php    
    //Класс ручка
class pen{
    public function asd($g){
    $this->write = $g;
    }
    // атрибуты ручки
    // —----------------------------------------—
    public $body;
    public $kernel;
    public $cap;
    // —----------------------------------------—
    // поведение ручки
    // —----------------------------------------—
    // Ф-ия открытие колпачка
    public function open(){
    $this->$cap = false;
    echo "Снят колпачок ";
    }
    // Ф-ия писать
    public function write(){
    $this->$pen = write;
    echo "Ручка пишет ";
    }
    //Ф-ия закрыть
    public function close(){
        $this->$cap = true;
        echo "Ручка закрыта ";
    }
    // —----------------------------------------—
    }
    // Создаю объект ручки
    $pen = new pen();
    // —--------------------------------—
    // Жизненный цикл
    $pen->open();
    $pen->write();
    $pen->close();
    // —----------------------------------