<?php    
    //Класс тетрадь
class copybook{
    public function asd($g){
    $this->writeinformation = $g;
    }
    // атрибуты тетрадь
    // —----------------------------------------—
    public $paper;
    // —----------------------------------------—
    // поведение тетради
    // —----------------------------------------—
    // Ф-ия открыть тетрадь
    public function open(){
    echo "Открыли тетрадь ";
    }
    // Ф-ия выпить содержимое бутылки
    public function write(){
        echo "Записали информацию в тетрадь ";
    }
    //Ф-ия закрыть крышку
    public function close(){
        echo "Закрыли тетрадь ";
        }
    // —----------------------------------------—
    }
    // Создаю объект ручки
    $copybook = new copybook();
    // —--------------------------------—
    // Жизненный цикл
    $copybook->open();
    $copybook->write();
    $copybook->close();
    // —----------------------------------